PWBell_H2_200psi_10Paenv_15mmLd/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(rho|rhoU|rhoE)"
    {
        solver          smoothSolver;  //diagonal
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }


    "(U|e)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-7;
        relTol          0.1;
    }

    h
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }

    "(k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }
}


// ************************************************************************* //
